# Напишите программу, которая сначала спрашивает у пользователя его имя, 
# а затем выводит персональное приветствие

print("Как тебя зовут?")
name = input()
print(f"Привет, {name}! Приятно познакомиться")
