# Напишите программу, которая запрашивает у поьлзователя длину и ширину
# прямоугольника. После получения данных программа должна вычислить и вывести
# на экран площадь этого прямоугольника

length = int(input("Введите длину прямоугольника: "))
widht = int(input("Введите ширину прямоугольника: "))
print(f"Площадь прямоугольника: {widht * length}")
